<details ><summary>plan for ee-dev-ec2-y 2024-11-21 17:23:29 (UTC)</summary>
      <details ><summary>Locking successful</summary>
  Project diggerhq/demo-ee-features#ee-dev-ec2-y has been locked by PR #28
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_instance.example will be created
  + resource "aws_instance" "example" {
      + ami                                  = "ami-0e731c8a588258d0d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "example-instance"
        }
      + tags_all                             = {
          + "Name" = "example-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_security_group.instance will be created
  + resource "aws_security_group" "instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "example-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_parameter.foo will be updated in-place
  ~ resource "aws_ssm_parameter" "foo" {
        id              = "/dev/ec2"
      + insecure_value  = (known after apply)
        name            = "/dev/ec2"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (ee-dev-ec2-y)</summary>
  Terraform plan failed validation checks :x:<br>    Resource aws_instance.example (aws_instance) is missing required tag: cost-center<br>    Resource aws_instance.example (aws_instance) is missing required tag: environment<br>    Resource aws_instance.example (aws_instance) is missing required tag: owner<br>    Resource aws_security_group.instance (aws_security_group) is missing required tag: cost-center<br>    Resource aws_security_group.instance (aws_security_group) is missing required tag: environment<br>    Resource aws_security_group.instance (aws_security_group) is missing required tag: owner<br>    Resource aws_ssm_parameter.foo (aws_ssm_parameter) is missing required tag: cost-center<br>    Resource aws_ssm_parameter.foo (aws_ssm_parameter) is missing required tag: environment<br>    Resource aws_ssm_parameter.foo (aws_ssm_parameter) is missing required tag: owner
</details>

</details>